## Exploratory Data Analysis (EDA)

In [ ]:
import pandas as pd
import os
from pathlib import Path
import numpy as np

#### Read in the `users` dataset

In [ ]:
# wher are we?
home = Path.cwd()

In [ ]:
# where is the data?
data_dir = Path.joinpath(home.parent, 'data')
data_dir

PosixPath('/Users/austinlasseter/atelier/generalassembly/python-2-dc/09-pandas-eda-1/data')

In [ ]:
# what's in there?
os.listdir(data_dir)

['Production.ProductSubcategory.csv',
 'drinks.csv',
 'imdb_1000.csv',
 'ufo.csv',
 'Sales.SalesOrderHeader.csv',
 'titanic.csv',
 'u.user',
 'Sales.SalesOrderDetail.csv',
 'Production.Product.csv']

In [ ]:
# create path to our file
path2file = Path.joinpath(data_dir, 'u.user')

In [ ]:
# why is this wrong?
users = pd.read_csv(path2file, sep='|')
# user = pd.read_table(path2file)

users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Preliminary Examination Steps

In [ ]:
# what's my type?
type(users)

pandas.core.frame.DataFrame

In [ ]:
# what's the index?
users.index

RangeIndex(start=0, stop=943, step=1)

In [ ]:
# what are the columns?
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [ ]:
# what is the data type of each column?
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [ ]:
# what is a Pandas dataframe?
# it's an array of Numpy array
users.values[2]

array([3, 23, 'M', 'writer', '32067'], dtype=object)

In [ ]:
users.index[2]

2

In [ ]:
# concise summary of df
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

In [ ]:
# describe numeric cols
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [ ]:
# you can also describe non-numeric columns:
users.describe(include=['object'])
users.describe(include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

In [ ]:
# missing data?
users.isnull().sum()

user_id       0
age           0
gender        0
occupation    0
zip_code      0
dtype: int64

### Take a look at individual columns

In [ ]:
# select 1 column
users['gender'].tail()

938    F
939    M
940    M
941    F
942    M
Name: gender, dtype: object

In [ ]:
# select 2 cols
users[['gender', 'occupation']].sample(4)

    gender  occupation
507      M   marketing
731      F       other
329      F    educator
736      M  programmer

In [ ]:
# what is the column type?
type(users['gender'])

pandas.core.series.Series

### a few col methods

In [ ]:
# mean of numeric cols
users['age'].mean()
users['age'].median()
users['age'].std()
users['age'].min()
users['age'].max()
users['age'].count()

943

In [ ]:
# methods for string (non-numeric) columns
users['gender'].value_counts()
users['gender'].value_counts().sort_values(ascending=False)
users['gender'].value_counts().sort_index()
users['gender'].value_counts().values
users['gender'].value_counts().index

Index(['M', 'F'], dtype='object')

### Filtering and Sorting Columns

###### heading

esc - m - shift return

In [ ]:
# create a series of booleans
young_bool = users['age']<20
young_bool[:5]

0    False
1    False
2    False
3    False
4    False
Name: age, dtype: bool

In [ ]:
# apply that filter to my df
users[young_bool].head(5)

    user_id  age gender occupation zip_code
29       30    7      M    student    55436
35       36   19      F    student    93117
51       52   18      F    student    55105
56       57   16      M       none    84010
66       67   17      M    student    60402

In [ ]:
# combine into a single step
users[     users['age']<20    ].tail()

     user_id  age gender occupation zip_code
871      872   19      F    student    74078
879      880   13      M    student    83702
886      887   14      F    student    27249
903      904   17      F    student    61073
924      925   18      F   salesman    49036

In [ ]:
# you can select 1 column from the filtered results
newdf =  users[users['age']<20]    
newdf['occupation'].head()

29    student
35    student
51    student
56       none
66    student
Name: occupation, dtype: object

In [ ]:
# you can call any other method on this
users[users['age']<20]['occupation'].value_counts()    
users[users['age']<20]['occupation'].describe()

count          77
unique          7
top       student
freq           64
Name: occupation, dtype: object

## Multiple conditions

In [ ]:
users[(users['age']<20) & (users['gender']=='M')].describe()

          user_id        age
count   45.000000  45.000000
mean   448.311111  16.844444
std    240.713317   2.671019
min     30.000000   7.000000
25%    289.000000  16.000000
50%    451.000000  17.000000
75%    624.000000  19.000000
max    880.000000  19.000000

In [ ]:
# Pipe for 'or'
users[(users['age']<20) | (users['gender']=='M')].tail()

     user_id  age gender     occupation zip_code
935      936   24      M          other    32789
936      937   48      M       educator    98072
939      940   32      M  administrator    02215
940      941   20      M        student    97229
942      943   22      M        student    77841

In [ ]:
# you can also filter on a predefined list
list_of_occupations = ['doctor', 'lawyer', 'student']
users[users['occupation'].isin(list_of_occupations)]['gender'].head()

8     M
9     M
29    M
31    F
32    M
Name: gender, dtype: object

### Sorting

In [ ]:
# sort the entire df by one variable/column
users.sort_values('age').head(3)

     user_id  age gender occupation zip_code
29        30    7      M    student    55436
470      471   10      M    student    77459
288      289   11      M       none    94619

In [ ]:
# default is asc, you can also choose desc order
users.sort_values('age', ascending=True).tail(3)

     user_id  age gender     occupation zip_code
802      803   70      M  administrator    78212
859      860   70      F        retired    48322
480      481   73      M        retired    37771

In [ ]:
# set a column as the new index
users.set_index('user_id')

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107
26        49      M       engineer    21044
27        40      F      librarian    30030
28        32      M         writer    55369
29        41      M     programmer    94043
30         7      M        student    55436
...      ...    ...            ...      ...
914       44      F          other    08105
915       50      M  entertainment    60614
916       27      M       engineer    N2L5N
917       22      F        student    20006
918       40      M      scientist    70116
919       25      M          other    14216
920       30      F         artist    90008
921       20      F        student    98801
922       29      F  administrator    21114
923       21      M        student    E2E3R
924       29      M          other    11753
925       18      F       salesman    49036
926       49      M  entertainment    01701
927       23      M     programmer    55428
928       21      M        student    55408
929       44      M      scientist    53711
930       28      F      scientist    07310
931       60      M       educator    33556
932       58      M       educator    06437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

## Using Groupby

`groupby` aggregates a numeric column(s) by a categorical column(s)

In [ ]:
# for each occupation in the df, count the number of instances
users['occupation'].value_counts().head(3)

student     196
other       105
educator     95
Name: occupation, dtype: int64

In [ ]:
# another way to get this info
users.groupby(['occupation'])['user_id'].count()
users.groupby(['occupation'])['user_id'].count().sort_index()
users.groupby(['occupation'])['user_id'].count().sort_values(ascending=False).head()

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
Name: user_id, dtype: int64

In [ ]:
users['age'].describe()

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

In [ ]:
# six different aggregators you can use
users.groupby(['occupation'])['age'].max()
users.groupby(['occupation'])['age'].min()
users.groupby(['occupation'])['age'].mean()
users.groupby(['occupation'])['age'].median()
users.groupby(['occupation'])['age'].std()
users.groupby(['occupation'])['age'].count()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: age, dtype: int64

In [ ]:
# two ways to sort a groupby
users.groupby(['occupation'])['age'].mean().sort_values().head()
users.groupby(['occupation'])['age'].mean().sort_index(ascending=False).head()

occupation
writer        36.311111
technician    33.148148
student       22.081633
scientist     35.548387
salesman      35.666667
Name: age, dtype: float64

In [ ]:
# you can group by multiple [categorical] variables
print(users.columns)

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [ ]:
users.groupby(['occupation', 'gender', 'zip_code'])['age'].mean()

occupation     gender  zip_code
administrator  F       03062       51.0
                       03755       39.0
                       04102       50.0
                       15237       59.0
                       16506       49.0
                       16803       43.0
                       17345       30.0
                       19711       27.0
                       19716       49.0
                       20817       23.0
                       20879       54.0
                       21114       29.0
                       33763       48.0
                       42141       38.0
                       43204       51.0
                       44124       42.0
                       44224       47.0
                       44265       36.0
                       48103       38.0
                       49428       38.0
                       52241       34.0
                       52302       30.0
                       55337       33.0
                       55406       35.0
                       58202       51.0
                       60202       22.0
                       60476       37.0
                       68106       43.0
                       73034       48.0
                       78213       33.0
                                   ...
writer         F       90064       36.0
                       92115       40.0
                       94618       48.0
                       99709       49.0
               M       08534       52.0
                       10003       36.0
                       17604       30.0
                       27105       50.0
                       30068       26.0
                       32067       23.0
                       38115       26.0
                       40206       25.0
                       40515       49.0
                       52245       21.0
                       55105       49.0
                       55113       42.0
                       55369       32.0
                       55408       26.0
                       59801       52.0
                       60804       24.0
                       63108       25.0
                       80209       48.0
                       90019       34.0
                       91505       28.0
                       92154       22.0
                       92653       21.0
                       93055       40.0
                       94583       60.0
                       95468       51.0
                       E2A4H       27.0
Name: age, Length: 915, dtype: float64

In [ ]:
# you can also aggregate multiple [numeric] variables
users.groupby(['occupation', 'gender'])[['age', 'user_id']].mean()

                            age     user_id
occupation    gender
administrator F       40.638889  443.944444
              M       37.162791  420.069767
artist        F       30.307692  432.153846
              M       32.333333  469.000000
doctor        M       43.571429  533.714286
educator      F       39.115385  454.730769
              M       43.101449  471.492754
engineer      F       29.500000  806.500000
              M       36.600000  445.553846
entertainment F       31.000000  780.000000
              M       29.000000  350.250000
executive     F       44.000000  373.000000
              M       38.172414  427.413793
healthcare    F       39.818182  568.454545
              M       45.400000  354.000000
homemaker     F       34.166667  367.166667
              M       23.000000  898.000000
lawyer        F       39.500000  285.000000
              M       36.200000  373.900000
librarian     F       40.000000  449.137931
              M       40.000000  535.954545
marketing     F       37.200000  443.300000
              M       37.875000  434.375000
none          F       36.500000  521.750000
              M       18.600000  246.200000
other         F       35.472222  474.666667
              M       34.028986  578.246377
programmer    F       32.166667  411.166667
              M       33.216667  437.966667
retired       F       70.000000  860.000000
              M       62.538462  489.230769
salesman      F       27.000000  637.666667
              M       38.555556  447.333333
scientist     F       28.333333  611.666667
              M       36.321429  449.428571
student       F       20.750000  497.533333
              M       22.669118  479.404412
technician    F       38.000000  938.000000
              M       32.961538  480.692308
writer        F       37.631579  536.052632
              M       35.346154  466.230769

In [ ]:
# you can choose multiple aggregation methods
users.groupby(['occupation'])['age'].agg(['mean', 'median', 'min', 'max', 'std', 'count'])

                    mean  median  min  max        std  count
occupation
administrator  38.746835    37.0   21   70  11.123397     79
artist         31.392857    30.0   19   48   8.668116     28
doctor         43.571429    45.0   28   64  12.501428      7
educator       42.010526    42.0   23   63  10.413264     95
engineer       36.388060    36.0   22   70  11.199236     67
entertainment  29.222222    25.0   15   50  10.056052     18
executive      38.718750    38.5   22   69  10.608075     32
healthcare     41.562500    44.5   22   62  11.313524     16
homemaker      32.571429    32.0   20   50  10.737119      7
lawyer         36.750000    34.0   21   53  10.830303     12
librarian      40.000000    39.0   23   69  11.023611     51
marketing      37.615385    36.0   24   55   9.474500     26
none           26.555556    26.0   11   55  13.757826      9
other          34.523810    32.0   13   64  10.738227    105
programmer     33.121212    30.0   20   63   9.624512     66
retired        63.071429    63.0   51   73   5.757461     14
salesman       35.666667    34.0   18   66  14.079859     12
scientist      35.548387    37.0   23   55   7.392964     31
student        22.081633    21.0    7   42   5.284081    196
technician     33.148148    30.0   21   55   9.867210     27
writer         36.311111    36.0   18   60  11.423306     45

### A few other (lesser used) pandas methods

In [ ]:
# recode values
users['is_male']=users['gender'].map({'F':0, 'M':1})
users.head()

   user_id  age gender  occupation zip_code  is_male
0        1   24      M  technician    85711        1
1        2   53      F       other    94043        0
2        3   23      M      writer    32067        1
3        4   24      M  technician    43537        1
4        5   33      F       other    15213        0

In [ ]:
# duplicates
users.duplicated().head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [ ]:
# count the number of dupes in our df
users.isnull().sum()
users.duplicated().sum()

0